//#include<stdio.h>		//用别人东西需要给别人说
//#include <cfloat>
//#include<math.h>
//#include<string.h>
//#define _CRT_SECURE_NO_WARNINGS
//#define i 0
//#define one(x,y) x>y?x:y  //宏定义 将 one 替换为后面语句！！！
//int main()
//{////#define a 2//宏定义不能连续定义
////
//////===============第一个程序====================
////
//////套用函数返回值   能直接在主函数写调用函数 printf("%d",otherf())直接调用otherf;
//////but 更好定义变量以后可以直接输入这个变量就是函数返回值了
//////float max(float x, float y)
//////{
//////	if (x > y)
//////
//////		return x;
//////
//////	else
//////		return y;
//////
//////}
////
//////int otherf()
//////
//////{
//////	static int a = 1;
//////	a++;
//////
//////	printf("%d\n",a);
//////	
//////	return 0;
//////}
//////int a = 1; //全局变量--6.
//////枚举常量 enum     red yellow blue 是常量（被枚举的常量）不能改变   Corlr 不能直接调用 ？
//////enum Corlr
//////{
//////	red,//对应0       
//////	yellow,//对应1
//////	blue//对应2
//////};
//////enum Sex
//////{
//////	MALE,//对应0
//////	FAMALE//对应1
//////
//////};
////
//////enum abc
//////{
//////	a,
//////	b,
//////	c
//////};
////
////int main()					//在函数里面写代码 函数一般都有返回值
////{
////
////
////
////	//int tolprice;
////	//int num = 10;
////	//
////	//tolprice = num * one;
////	//int result = otherf();				//result 和otherf 函数都是整数对齐
////	//
////	//printf("购买总价格：%d\n", tolprice);
////	//printf("函数：%d\n", result);
////	//==========================第二个程序==================
////
////	//===========多个数值计算输出===========
////	//int a;
////	//int b;
////	//int c;
////	//int d;
////	//int e;
////	//int f;
////	//int g;
////	//unsigned u;
////
////	//a = 10;
////	//b = 11;
////	//c = 12;
////	//d = 13;
////	//u = -20;
////	//e = a + b;
////	//f = c + d;
////	//g = a + u;
////	//printf("a+b=%d%d,a+u=%d", e, f, g);    // 数字以此排序   在内容中直接用，隔开了
////	//============浮点数的计算表示==============================
////
////	/*double lf = 5;
////	printf("%lf",lf);*/
////	//float a;
////	//float b;
////	//a = 12345.6789e5;
////	//b = a + 10;
////	//printf("%f", a);				//浮点数不精确！！
////
////	////================================字符 和 数字（十进制）关系===========================
////	//char c1, c2;		// 字符类前面不能是数字
////	//c1 = 'a';			//对于字符的定义 单双引号   数字直接写就行（数字也是一种字符）
////	//c2 = 'b';
////	//printf("%c %c\n", c1+2, c2+1);  //这里如果规定%c -输出字符       %d-数字   这是一种ascll 码与数字的对应
////	//printf("%d,%d\n", c1-1, c2-2);	//字符不用逗号  数字需要逗号
////
////
////	////====================定义常量===================================面积计算===========
////
////	//printf("hello world");				//遇到\n就认为是换行 （就算新定义 a='\n'  一看到\n也还是换行） 
////
////	//printf("%c", ENTER);				//定义字符需要‘’单引号
////
////	//const int a = 2;		//定义不会改变的量 const define 是一样的效果！--------------常量 ----常量可以是任何东西  字符 数字
////	//const int b = 3;
////	//const int LONG = 2;
////	//const int WIDE = 2;
////	//int area = LONG * WIDE;		//可以直接定义
////	//printf("面积为：%d", area);
////
////	//=================
////	// 1.整形  浮点   常量   表示  标识符号输入，
////	// 2. 不同类型向系统申请内存不同！ 计算不同类型的占内存大小 原因：short  long占取内存大小不同切记权重！
////	//【有无符号 和整数这种类型不同  】
////	//3. sizeof  获取到的是整数型    long(4/8)  int(4)
////	//4. 申请内存  char a = ‘1’   这个char就有一股力量！！！申请内存 
////	//5.单双精度类 指定   从“double”到“float”截断   直接后面f给他定义一下 
////	//6.局部 全局变量  就是大括号内 外  在一个大括号内 局部（大括号内的局部）>全局
////	// 
////	
////	//.====================== 
////	//2.3. 4. 
////	//int insize = sizeof(int);
////	//int insize10 = insize * 8;
////	//printf("%d\n",insize10);
////	//printf("%d\n",sizeof(short int));
////	//printf("%d\n",sizeof(char));
////	//printf("%d\n",sizeof(float));
////	//printf("%d\n",sizeof(double));
////	//printf("%d",sizeof(long));
////	//float a = 95.6f;  //5.
////	//6.
////	//{
////	//	int a = 2;     //局部变量--大括号中的局部  6.
////	//}
////	
////	//printf("%d",a);
////	//unsigned u = 1;
////
////
////
////
////
////	//==============================
////
////
////	//==================scanf scanf   scanf  的学习================='
////	// 1.%d 是用来预先占位置的！！！   &取地址   取地址预先占位置   
////	//2.c 语法规定  定义只能放前面！
////
////	/*int num1 = 0;
////	int num2 = 0;
////	int sum = 0;
////	scanf_s("%d%d",&num1,&num2);
////
////	sum = num1 + num2;
////	printf("%d",sum);*/
////	//==================变量   作用域  生命周期===============
////	//一.作用域
////	// 1.大括号有限制作用 在大括号里面的都是大括号的 大括号1套大括号2  大括号1里面变量  大括号2可以随便用
////	//2.多个源文件  例  源1  源2   1中全局变量  不能直接在2 中用  需要在2中声明一下！！extern
////	//3.局部只作用于局部括号的范围  全局作用于整个项目工程
////
////	// 二.生命周期
////	//1.局部  进括号 开始
////	//2.全局  随着程序结束而结束
////
////	/*	extern	int num;
////		printf("%d\n",num);*/
////	//==============常量===========
////
////		//1.字面常量   
////		//3.1415;
////		//156;
////		//2.const int 的常量----------常变量   
////		//但终归是变量！！！！！只是给他了个属性  在数组中 用必须是正统的常量  你这个杂种我们不接受
////		//3.define类常量---正统
////		//4.枚举常量 enum ：列举出来的常量
////		// enum Corlr s（被定义的）= 枚举变量一种  （它会显示数字）
////		///*enum Corlr s = red;  //枚举常量定义完其中的量 想要用需要新定义，定义整型量
////		/*enum Sex w = MALE;
////		printf("%d\n",s);
////
////		printf("%d",w);*/
////
//////const int a = 1;
//////int arr[a] = { 0 };
////
//////-----------------------字符串---------------------
//////1.字符串（"一大堆连续汉字等"）""引字符串  ''引字符    
////// 当字符的时候就需要'' 字符串的时候""
////// 、字符（'a',' b',' c'）的定义 ，用数组储存，
//////储存字符串特点：数组储存字符串那么最后会自动加个'\0' 或者 直接0  视为结束符而不是字符 
////// 储存字符:需要加个'\0'  0
//////strlen --获取字符串内存 strlen（arr1）-【整数%d占位】  0不计入  且以\0为终点 停止字符串输出！！！
////// but 直接输入0 （不能'0'这样视为字符） 也是视为\0  '\0'----字符形式--\0  就是结束符
////// 二.数组相关：
//////	 0.预先框定内存 初始化0
//////	 1.储存东西条件 1.初始化内容/ 2.指定大小  : 
//////	 2.注意：a.转义字符'\0' 0 决定了数组元素哪里停 =====规定数组大小之后-1才是真正的可以存储的空间
//////			 b.字符串自带\0  字符需要我们'\0' 0 
//////char arr2[n] = {'a',0};		//2.数组的大小只能是常量 不能改变
//////char arr2[10] = {'a',0};  
//////char arr2[2] = {'a','b',0};	//4..规定数组大了不一定全用，但是数组不能小  strlen只看\0
//////int arr3[10] = { 1,2,3,4 };
//////printf("第五位%d，第一位%d\n",arr3[4],arr3[0]);// 框定内存初始化为0
//////printf("%d",sizeof(arr3)/sizeof(arr3[0]));  //初始化内存 因为int占4字节 所以arr数组占4*10内存都是他的
//////printf("%d",strlen("你好"));	//		 5.strlen 也可以求字符串的长度
//////char arr1[] = "WOAINI";			//字符串的定义 =“” 
//////char  char2[20] = { 'a','b','c',0 }; //这样数组里面有3个byte(字符) 在第4个字符遇到'\0',0
//////printf("%d",strlen(char2));
//////printf("%s\n",arr2);
//////printf("%d\n",strlen(arr2));
//////char arr1[] = "abc";
//////char arr2[] = { 'a','b','c','0','\0' };
//////printf("%d\n",strlen(arr1));
//////printf("%d\n",strlen(arr2));	
////
//////----------计算圆的面积周长---------知识：浮点型位数  小数点的位数
//////int r = 5;
//////float s = pi * r * r;
//////float c = pi * 2 * r;
//////printf("面积为%6.3f",s);  //这边是总共位数（带着小数点）但是势力没有本身大.小数点位数多少
//////printf("周长为%5.4f",c);
//////float R = 0;
//////
//////printf("请输入圆的半径:",R);
//////scanf_s("%f",&R);
//////float s = pi * pow(R,2);
//////float c = pi * 2 * R;
//////printf("面积为：%5.3f\n",s);
//////printf("周长为：%5.3f",c);
//////float R = 0;
//////printf("输入圆的半径");
//////scanf_s("%f",&R);   //scanf别打字...
//////float s = pi * pow(R, 2);
//////float c = pi * 2 * R;
//////printf("面积为：%f\n周长为：%f",s,c);
////
////
//////float L = 0, W = 0;
//////printf("你的长:\n你的宽:\n");
//////scanf_s("%f%f",L,W);
//////float area = L * W;
//////printf("面积为：%f",area);
//////------ASCLL 码转换  
//////定义char 一个一个定义  切记别a = 'a'不然出问题！！！
//////char mimi = 'a';
//////int cacl = mimi - 32;
//////printf("ASCLL数字为%d\n字母为：%c",cacl,cacl);
//////===========================转义号\ 转变某符号原本的意思。
//////\t Tab 水平制表 \t 转义  \\t反转义  你想改变他嘛 加个\ strlen 求字符串长度
//////\ddd 当作 8 进制对应的十进制 对应的ASCLL码 的字符  //xdd \\x61 ----十六进制...ASCLL码 （字符）
////
////
//////====================if语句================
//////char Choose = '0';
//////printf("是否创造世界：是/否>:");
//////
//////
//////scanf_s("%d",&Choose);
//////if (Choose == "是")
//////{
//////	printf("加入我们");
//////}
//////else
//////{
//////	printf("仔细斟酌");
//////}
////
//////int line = 1;
//////while (line < 10000)
//////{
//////	printf("敲一个w代码%d\n", line);
//////
//////	line++;
//////}
////
//////--------------函数  280
//////作用：1.我们自己写个函数 让所有人都能调用  例如printf
//////2.利用方法  新函数 int  Add（int x,int y ）
//////3.错误：左值等号  这是多次定义变量了
//////4.一些用处特点：
//////		a.我们可以预输入 在函数（）里面定义  其他函数可以直接输入预输入值用于计算
//////		b.对应其他函数  我们可以直接利用此函数计算量
////
//////		
//////int ac;
//////int b;
////// ac = 10;
////// b = 20;
//////printf("%d",Add(ac,b));
//////
////
////
//////------------数组 -----------------------------------10.23悟 规定类型就是指定内存空间大小存放东西 
//////					1.作用：存放多个相同数据
////	//	  2		//.特点：利用下标访问元素，数组下标从0开始arr[4]访问4下标
//////					3.利用while语句多次访问数组元素
////
//////-----------操作符
//////1. /取商   %取余/取模
//////2.移位 ==二进制位的移位  b = w<<1 w>>1   移位然后赋值！ 
////////
//////printf("%d",otherf());
////
//////一.操作符
//////-1.位左右移，位操作符号
////// // &与 |或  ^异或
//////-----------------二进制与十进制转化的新视角
//////----------------1		1	 1	 1	 1	 1 
//////----------------32   16    8   4   2   1 
//////----------------当33的时候   认为32权重  1    1权重 1
//////---------------尽管位操作符搞得是2进制，输出还是十进制的
//////---------------2.赋值操作符
////// 2.=复合赋值  ==判断是否相等
///////3.a *= 10  先将a乘10再赋给a   a = a * 10   >>= n  向右移n位
//////4.单目/双目 
//////		能运算的量的数目 单！a  双 a + b  三目
//////!变假
//////! 
//////
//////int a = 5;
//////a >>= 1 ;
//////printf("%d",!a);
//////float x = 0, y = 0;
//////scanf("%f%f",&x,&y);
//////
//////
//////printf("%f", max(x, y));
////
//////===============运算符号
//////int a = 0;
//////printf("%d\n",!a);   //逻辑非 将真变假 假到真    二进制非 不同
//////int a = 0;///4字节 = 32bit 那么 在内存就是 111111111111 补码---存在内存中的  输出是原码 所以1111111---100000001 
//////
//////int b = ~ a;  //所以是-1
//////int c = 1;
//////
//////
//////printf("a&&b=%d\n a||b =%d\n a&&c = %d\n a||c = %d ",a&&b,a||b,a&&c,a||c);
////// 逻辑 与 &&   或||   是对于真/假进行运算；
//////int a = 10, b = 20,max = 0;
//////max = a > b ? a : b;
//////printf("%d", a > b ? a : b);    //三目运算max =  条件?a:b 其中a  b为返回值  让max接受
//////int a = 10,b= 20,max = 0;
////
//////两种不同算法 判断a b 输出
//////if (a >= b)
//////printf("%d", a);
//////else
//////printf("%d",b);
////// 
//////						直接输出a/b
//////if (a >= b)
//////max = a;
//////else
//////max = b;
//////printf("%d",max);
//////char a1 = 'a',c1 = 'c', d1 = 'd';
//////int b1 = a1 * 5;
//////int c2 = c1 * 2;
//////int d2 = d1 * 2;
//////printf("%d\nb的值为%c\nc1为%c\nd1为%c\n", a1,b1,c1,d1);
//////printf("%c\n%c\n",c2,d2);
////////float a;
////////int b = 19, c = 2;
////////a = b / c;
////////printf("%f",a);//用东西接收 a/b 然后输出 可以多次使用于其他可用的地方
////
//////----------------运算
//////	float  a ;
//////a = -15.0 / 2;   除法看首个数据正负
//////printf("%d", (int)a);   强转换 优先级 ＞+-*/
//////===============  %的取余数
//////  取的最后一位。 所以我们可以/10 等取出余数
////////int a = 123;
////////int b = a % 10 * 100 + a / 10 % 10 * 10 + a / 100 % 10;
////////printf("%d",b);
//////=========利用ASCLL码加密  
////	// i < n     运行n次 i < = n 运行n+1  看i 如果i要到达 n 如果是 i = 0 需要n次运算到达n  先运算再加
//////int a1 = 'a';
//////int x1 = a1 % 10 * 10 + a1 / 10 % 10;
//////printf("%d",x1);
////
//////int y1,y2,y3,y4,y5,y6,y7,y8,y9, b1 = 123456789;
//////y1 = b1 % 10;
//////y2 = b1 / 10 % 10;
//////y3 = b1 / 100 % 10;
//////y4 = b1 / 1000 % 10;
//////y5 = b1 / 10000 % 10;
//////y6 = b1 / 100000 % 10;
//////y7 = b1 / 1000000 % 10;
//////y8 = b1 / 10000000 % 10;
//////y9 = b1 / 100000000 % 10;
//////int arr[] = { y1,y2,y3,y4,y5,y6,y7,y8,y9 };
//////
//////int i;
//////for (i = 0;i< 9;i++)   
//////{
//////		
//////	printf("%d", arr[i]);
//////
////
////
//////=================11.9		
//////函数typedef 为类型定义
//////static 保持静态 均衡  大的不能太大 小的不能太小
//////将局部生命增大 全局范围缩小 函数连接减小
////
//////
//////typedef int u1;
//////u1 a = 1;
//////printf("%d",a);
//////int i = 0;
//////for (i = 0; i < 2; i++)
//////{
//////
//////	otherf();
//////	
//////	
//////	
//////	printf("0");
//////	
//////}
//////extern int add();
//////
//////add();
//////==============宏定义 
//////将一个名称定义成一个运算例子：one(x,y) x>y?x:y;  将one 直接替换后面语句并且x y 替换
////// 函数 这类直接输入已经定义的量就行了
//////int x = 0, y = 0, max;
//////scanf("%d%d",&x,&y);
//////max = one( x,  y);
//////printf("%d",max);
//////int x = 0, y = 0, max;
//////scanf("%d%d",&x,&y);
//////max = one(x, y);
//////printf("%d",max);
//////====================指针 int* p（整型的储存数值）----类型对应
//////1.储存地址。：每个内存单元 1byte（bit储存太小了） 如果32根地址线 那么有2^32 * 1byte 内存
//////32位系统 地址 4byte  64--- 8byte
//////char a = 'b';
//////char* p = &a;    //定义 指针 记得类型对齐！！！ 取地址
//////printf("%p\n",p);  //输出地址
//////*p = 'z';			//修改地址内容 
//////printf("%c",a);
//////int a = 15;
//////int* p = &a;
//////printf("%d\n", a);
//////printf("%p\n",p);
//////printf("%p\n",&a);
//////*p = 20;
//////printf("%d",a);
//////
//////char c1 = 'w';
//////char* pc = &c1;
//////printf("%p\n",pc);
//////
//////printf("%c\n",c1);
//////*pc = 'h';
//////printf("%c\n", c1);
//////printf("%d\n",sizeof(double*));
//////=============结构体
//////1.大致：直接定义类型描述复杂的东西 例如 人  在大括号里面输入 他包含的分类（需要定义类型）
////// 2.输出  变量名字.name
////// 指针变量输出内容
////// 不解引用 直接指向  p ->name
////// 指针解引用 用（*).name 输出
////// struct man === 这个是我们定义的类型
////// 数组内字符串改 需要 strcpy(名字，内容) 
//////
//////struct MAN
//////{
//////	char name[20];
//////		int age;
//////	
//////};
//////struct MAN YOU = { "我想打你", 15};
//////printf("%s\n%d\n",YOU.name,YOU.age);
//////struct MAN* p1 = &YOU;
//////printf("地址为：%p,\n name为：%s",p1,p1->name);
////
////
////
//////===============
////
//////int x;
//////scanf("%d",&x);
////
//////if (0 == x % 2)
//////	{
//////	printf("偶数");
//////
//////	}
//////else
//////	{
//////	printf("奇数");
//////
//////	}
//int i = 1;
//
//while (i <= 100)
//
//{
//	if (i % 2 == 1)
//
//		printf("%d\n", i);
//
//
//	i++;
//}
//return 0;
//}
////函数  分支 262
////int Add(int x, int y) //如何规定以及认知
////						1.函数类型定义  括号里面是存放函数参数的  
////{					    //2.大括号里面是运算 
////					    //3.以后我们算加法 直接调用这个函数运算就行
////					    //4.直接输入Add（2.3）直接输入参数 就可以参与这个函数的运算了
////	int z = x + y;		//5.必须写在准备用的上面不然不能用,返回一个值可以是+-*/的运算或者量但是不能赋值（z = x* y）这种
////	return z;
////}
//
