////////////#include<stdio.h>
////////////#include<math.h>
//////////// #define _CRT_SECURE_NO_WARNINGS
////////////#define _CRT_SECURE_NO_WARNINGS
////////////
////////////int main()
////////////{
////////////////////int a, b, max, n, i;
////////////////////scanf("%d", &n);			//输入多少个数字呢   包含a在内了  n代表让几个数进行比较 
////////////////////scanf("%d", &a);
////////////////////max = a;			//循环将最大值储存在max中
////////////////////
////////////////////for (i = 1; i < n; i++)			//循环多少次呢？ 直接想到你输入多少次数字我就循环多少次
////////////////////{
////////////////////	scanf_s("%d", &b);
////////////////////	if (a < b)
////////////////////	{
////////////////////		max = b;
////////////////////	}
////////////////////}
////////////////////
////////////////////printf("%d",max);
////////////////////=========3个数字排列大小
//////////////////	int a, b, c,min;
//////////////////	scanf("%d%d%d",&a,&b,&c);
//////////////////
//////////////////
//////////////////	if (a < b)
//////////////////	{
//////////////////		min = b;
//////////////////		b = a;
//////////////////		a = min;
//////////////////	}
//////////////////
//////////////////
//////////////////	if (a < c)
//////////////////	{
//////////////////		min = c;
//////////////////		c = a;
//////////////////		a = min;
//////////////////
//////////////////
//////////////////	}
//////////////////	if (b < c)
//////////////////	{
//////////////////		min = c;
//////////////////		b = c;
//////////////////		b = min;
//////////////////
//////////////////
//////////////////
//////////////////	}
//////////////////	printf("%d%d%d",a,b,c);
//////////////////
//////////////////
//////////////////return 0;
//////////////////}
////////////////#include <stdio.h>
////////////////int main()
////////////////{
////////////////    int A[305] = { 0 };
////////////////    for (int x = 1; x <= 300; x++)
////////////////    {
////////////////        for (int i = 2; i * i <= x; i++)
////////////////            if (x % i == 0)
////////////////            {
////////////////                A[x] += i;
////////////////                if (i * i != x)
////////////////                    A[x] += x / i;
////////////////            }
////////////////        A[x]++; //1是每个数的因数
////////////////    }
////////////////    for (int i = 1; i <= 300 - 1; i++)
////////////////        for (int j = i + 1; j <= 300; j++)
////////////////            if (A[i] == j && A[j] == i)
////////////////                printf("%d %d\n", i, j);
////////////////    return 0;
////////////////}
//////////////
//////////////
//////////////#include<stdio.h>
//////////////#include<math.h>
//////////////int main()
//////////////{
//////////////	int n = 0, sum = 0;
//////////////	//	scanf("%d",&n);
//////////////	for (n = 1; n <= 10; n++)
//////////////	{
//////////////
//////////////		sum = sum + pow(n, 2) + 1;
//////////////
//////////////	}
//////////////	printf("%d", sum);
//////////////	return 0;
//////////////}
//////////////
//////////////#include<stdio.h>
//////////////
//////////////
//////////////int main()
//////////////{
//////////////
//////////////	printf("Hello,World!\n大学生机器人创新实验室欢迎你!\n");
//////////////	return 0;
//////////////}
////////////
//////////////#include<stdio.h>
//////////////
//////////////int main()
//////////////{
//////////////	int x = 0, y = 0, z = 0, mul = 0;
//////////////	scanf("%d%d%d", &x, &y, &z);
//////////////	mul = x * y * z;
//////////////	printf("%d", mul);
//////////////	return 0;
//////////////}
//////////////#include<stdio.h>
////////////
//////////////int main()
//////////////{
//////////////	int x = 0;
//////////////	scanf("%d", &x);
//////////////	if (x % 2 == 0)
//////////////	{
//////////////		printf("这个数是偶数");
//////////////	}
//////////////	else
//////////////	{
//////////////		printf("这个数是奇数");
//////////////	}
//////////////
//////////////
//////////////	return 0;
//////////////}
//////////////#include<stdio.h>
//////////////#include<math.h>
//////////////int main()
//////////////{
//////////////	int n = 0, sum = 0;
//////////////	//	scanf("%d",&n);
//////////////	for (n = 1; n <= 10; n++)
//////////////	{
//////////////
//////////////		sum = sum + pow(n, 2) + 1;
//////////////
//////////////	}
//////////////	printf("%d", sum);
//////////////	return 0;
//////////////}
//////////////#define _CRT_SECURE_NO_WARNINGS
//////////////#include<stdio.h>
//////////////#include<string.h>
//////////////#include<windows.h>
//////////////int main()
//////////////{
////////////	int a = 2, i = 2, j = 0, sum_a = 0, n = 0, b = 0, sum_b = 0;
////////////	int factor_a[200] = { 0 };
////////////	int factor_b[200] = { 0 };
////////////	for (a = 2; a <= 300; a++)
////////////	{
////////////		n = 0, sum_a = 0;   //循环使用需要更新！！！！
////////////		for (i = 1; i < a; i++)
////////////			if (a % i == 0)
////////////				factor_a[n++] = i;
////////////		for (j = 0; j < n; j++)
////////////			sum_a += factor_a[j];
////////////		b = sum_a;
////////////
////////////		if (b != 1 && b > a)
////////////		{
////////////			n = 0;
////////////			sum_b = 0;
////////////			for (i = 1; i < b; i++)
////////////				if (b % i == 0)
////////////					factor_b[n++] = i;   //放到里面来
////////////
////////////			for (j = 0; j < n; j++)      //
////////////				sum_b += factor_b[j];
////////////
////////////			if (sum_b == a)
////////////				printf("\n%d------%d\n", a, b);
////////////		}
////////////	}
////////////	return 0;
////////////}
////////#include <stdio.h>
////////int main()
////////{
////////    int i, j;
////////    for (i = 1; i <= 4; i++) {  //外层for循环
////////        for (j = 1; j <= 4; j++) {  //内层for循环
////////            printf("%-4d", i * j);
////////        }
////////        printf("\n");
////////    }
////////    return 0;
////////}



//#include<stdio.h>
//
//
//int cacl(int x, int y)
//{
//	int temp = 0;
//	
//
//
//	while (x % y != 0)
//	{
//
//		temp = x % y;
//		x = y;
//		y = temp;
//
//	}
//	return y;
//
//}
//int main()
//{
//	int x = 0, y = 0;
//	scanf("%d%d",&x,&y);
//	int ret = cacl(x,y);
//	printf("%d",ret);
//
//	return 0;
//}

#include<stdio.h>


//void bubble_sort(int arr[], int sz)
//{
//
//	int i = 0, j = 0;
//	int temp = 0;
//	for(j = 0;j<sz-1;j++)
//	{ 
//		for (i = 0; i < sz-1-j; i++)
//		{
//			if (arr[i] < arr[i + 1])
//			{
//				temp = arr[i];
//				arr[i] = arr[i + 1];
//				arr[i + 1] = temp;
//			}
//
//
//		}
//
//	}
//
//
//
//}
//
//int main()
//{
//	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
//
//	int sz = sizeof(arr) / sizeof(arr[0]);
//	int i = 0;
//	bubble_sort(arr,sz);
//	for (i = 0; i < sz; i++)
//	{
//
//
//		printf("%d ",arr[i]);
//	}
//
//
//
//	return 0;
//}
//#include<stdio.h>
//int main()
//{
//
//	int i = 0,sz = 0,spa_cout = 0,num_cout = 0,word_cout = 0;
//	
//char arr[200] = { '0'};
//	
//char a = getchar();       
//
//for(i = 0;a != '\n'; i++)
//{
//	arr[i] = a;
//	a = getchar();
//
//	
//}
//sz = strlen(arr);
//
//for (i = 0; i < sz; i++)
//{
//	if (arr[i] == 32)
//	{
//		spa_cout++;
//	}
//	if (arr[i] >=48&&arr[i]<=57 )
//	{
//		num_cout++;
//	}
//	if ((arr[i] >= 65 && arr[i] <= 90)||(arr[i] >= 97 && arr[i] <= 122))
//	{
//		word_cout++;
//	}
//
//}
//
//printf("%d %d %d ",spa_cout,num_cout,word_cout);
////cacl(arr,sz);
//
//return 0;
//
//}

//void exchance(int* x, int* y)
//{
//	int temp = 0;
//	temp = *x;
//	*x = *y;
//	*y = temp;
//
//
//
//
//}
//#include<stdio.h>
//int main()
//{
//	int x = 0, y = 0;
//	scanf("%d%d",&x,&y);
//	exchance(&x, &y);
//	printf("%d %d",x,y);
//
//	return 0;
//
//}
//#include<stdio.h>
//int main()
//{
//
//	int i = 0,num = 0,j=1;
//	
//	for (j = 1; j < 2022; j++)
//	{
//		i = j;
//		while (i !=0)
//		{
//			if (i%10 == 2)
//			{
//				num++;
//			}
//			i /= 10;
//		}
//
//
//
//
//
//	}
//	
//
//	printf("%d",num);
//
//
//
//
//	return 0;
//}
#include<stdio.h>

#include <assert.h>
//char* my_strcpy(char* des,const char* src)
//{
//	assert(des != NULL);
//
//	assert(src != NULL);
//	while(*des++ = *src++)
//	{
//		;
//	}
//
//
//}
//
//
//
//int main()
//{
//	//int i = 0,a = 0;
//	//int arr[] = { 1 };
//	//int* pa = arr;
//	////for (i = 0; i < 8; i++)
//	////{
//	////	*pa = 0;
//	////	pa++;
//	////	printf("haha ");
//
//	////}
//  优化 my_strcpy 
// 1.来源地无法改变	防止 目的地  来源地 互换  
// 2.防止传空地址  assert
// 3.赋值表达式 返回被赋的值 作为判断条件
// 4.
// 
//	char arr1[] = "#######";
//	char arr2[] = "bit";
//	char* ret = my_strcpy(arr1, arr2);
//	
//	printf("%s ", arr1);
//	return 0;
//}
//void my_strcpy(char* des, const char* src)			//防止写反  来源变成目的地
//{
//	assert(des != NULL);
//	assert(src != NULL);		//防止传过来空地址
//
//	while (*src != '\0')		//条件
//	{
//		//*des = *src;			//数组循环赋值
//		//des++;					//既然是运算完++不如 直接++
//		//src++;
//		*des++ = *src++;
//	}
//
//}
//void my_strcpy(char* des, const char* src)			//防止写反  来源变成目的地
//{
//	assert(des != NULL);
//	assert(src != NULL);		//防止传过来空地址
//
//	while (*des++ = *src++)		//条件
//	{
//		//*des = *src;			//数组循环赋值
//		//des++;					//既然是运算完++不如 直接++
//		//src++;
//					//赋值表达式结果为被赋的值  故  赋值0后直接返回0  可以直接当作判断条件
//	}
//
//}
//
//int main()
//{
//
//
//
//
//
//
//	char arr1[] = "moya";
//	char arr2[] = "************";
//
//	my_strcpy(arr2,arr1);
//
//	printf("%s",arr2);
//
//
//
//
//}
