#define _CRT_SECURE_NO_WARNINGS
#include<stdio.h>
#include<string.h>
#include<windows.h>
#include<math.h>
#include<time.h>
#include<stdlib.h>
////////void game()
////////{
////////	int y = 0;
////////	int ret = rand()%100 + 1;
////////	printf("%d\n",ret);
////////	printf("Please guess\n");
////////	scanf("%d",&y);
////////	while (1)
////////	{
////////		if (y < ret)
////////		{
////////			printf("猜小了\n");
////////			scanf("%d", &y);
////////		}
////////		else if (y > ret)
////////		{
////////			printf("猜大了\n");
////////			scanf("%d", &y);
////////		}
////////		else
////////		{
////////			printf("Bingo\n");
////////			break;
////////		}
////////	}
////////	
//////////}
////////int main()
////////{
////////	srand((unsigned int)time(NULL));
//////////////	/*int i = 1;
//////////////	while (i <= 100)
//////////////	{
//////////////		if (i % 2 != 0)
//////////////			printf("%d\n",i);
//////////////		i++;
//////////////	}*/
//////////////	//===========什么类型都可以判断.
//////////////	//数组  实型 不能判断
//////////////	
//////////////	/*int a = 3;
//////////////	float a = 3.14;*/
//////////////	/*char ch[] = { 'd','c','b','a','\0' };*/
//////////////	/*int a = 3;
//////////////	if (3 == a)  
//////////////	if (3.14 == a)*/
//////////////	/*if (ch[] = { 'd','c','b','a','\0' })*/
//////////////	/*{
//////////////		printf("是h");
//////////////	}
//////////////	else
//////////////	{
//////////////		printf("不是");
//////////////	}*/
//////////////
////////////////======
//////////////
//////////////	/*char ch;*/
//////////////	//scanf("%c",&ch);					//getchar 只拿走一个
//////////////	////if ((ch = getchar()) ==  EOF)    //scanf和getchar 都是在缓冲区！拿走字符！
//////////////	//if(ch == EOF)		//getchar 能获取ctrl+z--EOF(认为缓冲区为空)  回车可储存在缓冲被当作字符---\n
//////////////						//
//////////////	/*{
//////////////
//////////////	//	printf("空的");
//////////////	//}
//////////////	//else
//////////////	//{
//////////////
//////////////	//	putchar(ch);
//////////////	//}*/
//////////////	/////输入密码 然后确认
//////////////	//char ch[18] = {0};
//////////////	//scanf("%s",&ch);
//////////////	//printf("确认您的密码\n确认/返回：T/F\n");
//////////////	//char a = '0';
//////////////	//char b;			
//////////////	////while ((b = getchar()) != '\n') // 这里是在缓冲区（只要有就取）循环取 不是\n就循环取 已经将\n取出如果等于就出循环. 
//////////////	////{
//////////////	////}
//////////////	//if ((a = getchar()) == 'T')			//这里是再取一次 但是前面已经将缓冲区取完了所以需要输入
//////////////	//{
//////////////
//////////////	//	printf("已经确认");
//////////////	//}
//////////////	//else
//////////////	//{
//////////////	//	printf("错误");
//////////////	}
//////////////	// 
//////////////	// 
//////////////	//
//////////////	///*char ch1;
//////////////	////getchar();
//////////////	//ch1 = getchar();
//////////////	//
//////////////	//if (ch1 == EOF)
//////////////	//{
//////////////
//////////////	//	printf("空");
//////////////	//}
//////////////	//else
//////////////	//{
//////////////	//	
//////////////	//	printf("你至少输入了一个字符");
//////////////	//}*/
//////////////	//===============for
//////////////	//int i = 1;
//////////////	//for (i = 1; i <= 10; i++)     //for  2.初始化 2.调整  3.条件判断 1.循环功能  
//////////////	//{								
//////////////	//	if (i == 5)					//for 的break 直接退出循环
//////////////	//								//continue 退出循环的功能进入调整！
//////////////	//		continue;
//////////////	//	printf("%d\n",i);
//////////////	//}
////////////// 	  int i = 0, k = 1, n = 0;
////////////	/*for (i = 0;k = 2;i++) //for的条件判断依据 表达式返回值 赋值表达式返回值就是赋的值
////////////	{
////////////
////////////		printf("helloworld");
////////////	}*/
//////////////	//=============将输入的数字比较  
//////////////	
//////////////int a, b, max, n, i;
//////////////scanf("%d",&n);			//输入多少个数字呢   包含a在内了  n代表让几个数进行比较 
//////////////scanf("%d",&a);
//////////////max = a;			//循环将最大值储存在max中
//////////////
//////////////for (i = 1;i<n;i++)			//循环多少次呢？ 直接想到你输入多少次数字我就循环多少次
//////////////{
//////////////	scanf("%d",&b);
//////////////	if (a < b)
//////////////	{
//////////////		max = b;
//////////////	}
//////////////}
//////////////printf("%d",max);
////////////
//////////////阶乘 转化思想  有  代替  条件
//////////////原理：1 * 2 * 3 * 4 * ......*n  有一种累加效应 符合调整  累乘 将值保存下来 在下一次循环继续用  条件乘到N就行了
//////////////求 阶乘和 
//////////////过程 1.思路：有阶乘  在循环如何取出来运算？ 
//////////////		2.思路：循环内无法运算 所以 取出循环内 然后计算  再回到循环  循环 --出来---循环 所以用到新循环
//////////////		3.得出：所以功能就是此循环+将至保存  初始/调整/条件是？ 条件用于出循环 然后再进入 + 累加到n
//////////////		4.所以n是关键
////////////	// //累乘产生：循环1！*2
//////////////int i = 1, n = 0,get = 1,N = 1,sum = 0;
//////////////scanf("%d",&N);
//////////////
//////////////for (n = 1;n<=N;n++)
//////////////{
//////////////	get = 1;
//////////////	for (i = 1; i <= n; i++)
//////////////	{
//////////////		get = get * i;
//////////////
//////////////	}
//////////////	sum = sum + get;
//////////////}
//////////////printf("%d",sum);
//////////////int i = 1, n = 0, get = 1, N = 1, sum = 0;
//////////////scanf("%d", &N);
//////////////
//////////////for (n = 1; n <= N; n++)
//////////////{
//////////////	
//////////////	
//////////////	get = get * n;
//////////////	sum = sum + get;
//////////////}
//////////////printf("%d", sum);
//////////////int N = 0,get = 1,i = 1,n=1,sum = 0;
//////////////scanf("%d",&N);
//////////////
//////////////for (n = 1; n <= N; n++)
//////////////{
//////////////	
//////////////	
//////////////	
//////////////	get = get * n;
//////////////
//////////////	
//////////////	sum = get + sum;
//////////////}
//////////////printf("%d",sum);
//////////////===============有序的搜索
////////////// 0-sizeof(num)/sizeof(num[0])   全部的寻找  最多N次
//////////////int n = 0,i=0,sz;
//////////////printf("输入你想找的数字\n");
//////////////scanf("%d",&n);
//////////////int num[] = {1,2,3,4,5,6,7,8,9,10};
//////////////sz = sizeof(num) / sizeof(num[0]);
//////////////for(i= 0;i<=sz;i++)
//////////////{
//////////////	if (n == num[i])
//////////////	{
//////////////		printf("找到了  在第%d下标\n",i);
//////////////	}
//////////////}
//////////////============半数查值 最多 log2(n) [n = sizeof(num)/sizeof(num[0])] 方法
//////////////
////////////
//////////////int num[] = { 1,2,3,4,5,6,7,8,9 };
//////////////
//////////////int left, right, average,n;
//////////////printf("请输入你想找的数字");
//////////////scanf("%d",&n);
//////////////left = 0, right = sizeof(num) / sizeof(num[0]) - 1;  //对应数组值
//////////////average = (left + right) / 2;							 //对应数组值
//////////////while (left<=right)
//////////////{
//////////////	if (n == num[average])  //比较			 //在已经排好序的情况下寻值  具体就是
//////////////											//	对应数组值   比较  找不到 改变搜索范围
//////////////	{
//////////////		printf("找到了在第%d下标\n", average);   
//////////////		break;
//////////////	}										
//////////////	else if (num[average] < n)		//比较	   找不到 改变搜索范围  （改变左，右标 ），再找平均值对应的数字
//////////////	{
//////////////		left = average + 1;
//////////////		average = (left + right) / 2;  //每次都需要更新平均
//////////////		printf("%d",left);
//////////////	}
//////////////	else if(num[average] > n)			//比较	
//////////////	{
//////////////		right = average - 1;
//////////////		average = (left + right) / 2;
//////////////		printf("%d",right);
//////////////	}
//////////////
//////////////	
//////////////}
//////////////
//////////////if (left > right)
//////////////{
//////////////	printf("找不到");
//////////////}
//////////////=============比较字符串---strcmp
//////////////char password[20] = "0";
////////////
//////////////int i = 0;
//////////////while(i<3)
//////////////{
//////////////	scanf("%s", &password);
//////////////	if (strcmp(password, "123321") == 0)  //比较字符串 strcmp
//////////////	{
//////////////		printf("正确\n");
//////////////
//////////////	}
//////////////	else
//////////////	{
//////////////		printf("错误");
//////////////	}
//////////////	i++;
//////////////}
////////////// =================数组值交换基于角标的对应   如果多次交换那么循环  i = m i<n  那么循环n- m次
//////////////char arr1[] = "###############";
//////////////char arr2[] = "weclome to aaaa";
//////////////
//////////////int left = 0, right;
//////////////right = strlen(arr1);
//////////////while(left<=right)
//////////////{
//////////////	arr1[left] = arr2[left];
//////////////	arr1[right] = arr2[right];
//////////////	printf("%s\n",arr1);
//////////////	Sleep(2000);
//////////////	system("cls");
//////////////	left++, right--;
//////////////}
//////////////if (left > right)
////////////////{
////////////////	printf("已经转换完毕");
////////////////}
//////////////int a;
//////////////scanf("%d", &a);
//////////////switch (a)
//////////////{
//////////////	case 1:
//////////////		{
//////////////		switch (a)
//////////////		{
//////////////		case 1:
//////////////		printf("1");
//////////////		case 2:
//////////////		("2");
//////////////		default:
//////////////		printf("default");
//////////////		case 3:
//////////////		printf("3");
//////////////		break;
//////////////		}
//////////////	case 2:
//////////////		printf("这里是第二个循环");  //足以说明 break 只停止自己的的这个分支
//////////////}
//////////////}
////////////
////////////
//////////////求最大公约数 -------辗转相除
//////////////（m,n）=(n,r)=(r,w)
//////////////int m = 0, n = 0,r = 0;
//////////////
//////////////scanf("%d%d",&m,&n);
//////////////if (m >= n)
//////////////{
//////////////	for ()
//////////////	{
//////////////		
//////////////			m = n;
//////////////			n = m % n;
//////////////
//////////////		
//////////////		
//////////////		
//////////////	}
//////////////}
//////////////
//////////////else
//////////////
////////////
////////////
////////////
////////////
////////////
//////////////========================亲和数
////////////
////////////int x, y, sum_x = 0 ,sum_y = 0, a = 0, i, j;
////////////int factor_x[100] = { 0 }, factor_y[100] = { 0 };
////////////
////////////for (x = 2, j = 0; i < x; i++)
////////////{
////////////	if (x % i == 0)
////////////	{
////////////		factor_x[j++] = i;
////////////		
////////////		a++;
////////////	}
////////////}
////////////
////////////for (j = 0; j < a; j++)
////////////{
////////////	sum_x = sum_x + factor_x[j];
////////////
////////////}
////////////printf("%d", sum_x);
//////////int a = 2, i = 2, j = 0, sum_a = 0, n = 0, b = 0,sum_b = 0;
//////////int factor_a[200] = {0};
//////////int factor_b[200] = {0};
//////////for (a = 2; a <= 300; a++)
//////////{
//////////	n = 0, sum_a = 0;   //循环使用需要更新！！！！
//////////	for (i = 1; i < a; i++)
//////////		if (a % i == 0)
//////////			factor_a[n++] = i;
//////////	for (j = 0; j < n; j++)
//////////		sum_a += factor_a[j];
//////////	b = sum_a;
//////////
//////////	if (b != 1&& b>a)
//////////	{
//////////		n = 0;
//////////		sum_b = 0;
//////////		for (i = 1; i < b; i++)
//////////			if (b % i == 0)
//////////				factor_b[n++] = i;   //放到里面来
//////////				
//////////		for (j = 0; j < n; j++)      //
//////////			sum_b += factor_b[j];
//////////	
//////////		if (sum_b == a)
//////////			printf("\n%d------%d\n",a,b);
//////////	}
////////////}
//////////int i = 1;
//////////for (i = 1; i <= 100; i++)
//////////{
////////	//if ((i % 10 == 7) || (i % 7 == 0))
////////	//	printf("过\n");
////////	//else
////////	////	printf("%d\n",i);                    //条件可能取对立面   17  27 过  14  21  过  那么我们有两种选择 符合条件/不符合 
////////	//if (i % 10 != 7 && i % 7 != 0)             //应该明白每个条件的关系  或还是且
////////	//{
////////	//	printf("%d\n", i);
////////	//}
////////	//else
////////	//	printf("过\n");
//////// //}
////////	/*int i = 1,j = 1, n = 0;
////////	scanf("%d",&n);
////////	for (i = 1; i <= n; i++)
////////	{
////////		for (j = 1; j <= i; j++)
////////		{
////////			printf("%d*%d = %2d  ",j,i,i*j);
////////
////////			if (j == i)
////////			{
////////				printf("\n");
////////			}
////////
////////		}
////////
////////
////////
////////	}*/
////////int i = 1000;
////////int cournt = 0;
////////for (i = 1000; i <= 2000; i++)
////////{
////////	if ((i % 4 == 0 && i % 100 != 0) || i % 400==0)
////////	{
////////		printf("%-4d  ", i);
////////		cournt++;
////////
////////	}
////////}
////////printf("%d",cournt);
////////
////////int count = 0, i = 1,a = 2;
////////for (a = 2; a <= 200; a++)
////////{
////////	for (i = 2; i <= a-1; i++)
////////	{
////////		if (a % i == 0)
////////		{
////////			break;
////////		}
////////		
////////	}
////////	if (a == i)
////////		printf("%d\n", a);
////////}
////////
////////int a = 0, b = 0;
////////while (scanf("%d%d", &a, &b) == 2)
////////{
////////	printf("%d\n",a+b);
////////}
////////int T = 0,i = 1,a = 0, b = 0;
////////scanf("%d",&T);
////////for (i = 1; i <= 3; i++)
////////{
////////	scanf("%d%d",&a,&b);
////////	printf("%d\n",a+b);
////////}
////////int a = 0, b = 0,num = 0;
////////scanf("%d%d",&a,&b);
////////num = a;
////////a = b;
////////b = num;
////////printf("%d %d\n",a,b);
////////
////////E:
//////	/*int a[5] = { 0 };
//////	int sum = 0,i = 0;
//////	for (i = 0; i <= 3; i++)
//////	{
//////		scanf("%d", &a[i]);
//////	}
//////	i = 0;
//////	for (i = 0; i <= 3; i++)
//////	{
//////		sum = sum + a[i];
//////	}
//////	printf("%d",sum);*/
////////int a = 0,sum = 0;
////////scanf("%d",&a);
////////sum = a % 10 + a / 10 % 10 + a / 100 % 10 + a / 1000 % 10;
////////printf("%d",sum);
//////
//////
//////
////////F:  //保留3位小数
////////float x_1 = 0, x_2 = 0, y_1 = 0, y_2 = 0,long_0 = 0;
////////scanf("%f%f%f%f",&x_1,&y_1,&x_2,&y_2);
////////long_0 = sqrt(pow(x_1 - x_2, 2) + pow(y_1 - y_2, 2));
////////printf("%.3f",long_0);
////////G:
////////
////////
////////float a = 0, b = 0, c = 0, d = 0,s = 0;
////////scanf("%f%f%f",&a,&b,&c);
////////d = 0.5 * (a + b + c);
////////
////////
////////s = sqrt(d * (d - a) * (d - b) * (d - c));
////////printf("%.2f",s);
////////
////////int x = 0;
////////scanf("%d",&x);
////////if ((x % 4 == 0 && x % 100 != 0) || x % 400 == 0)
////////printf("366");
////////else
////////printf("365");
////////I:
////////int x = 0, x_1 = 0, x_2 = 0, x_3 = 0,x_sum = 0;
////////
////////scanf("%d",&x);
////////x_1 = x % 10;
////////x_2 = x / 10 % 10;
////////x_3 = x / 100 % 10;
////////x_sum = pow(x_1, 3) + pow(x_2, 3) + pow(x_3, 3);
////////if (x == x_sum)
////////{
////////	printf("Yes");
////////}
////////else
////////printf("No");
//////
////////float x = 0, y = 0, z = 0,s = 0,d = 0;
////////scanf("%f%f%f",&x,&y,&z);
////////if (x + y > z && x + z > y && y + z > x)
////////{
////////	d = 0.5 * (x + y + z);
////////	s = sqrt(d * (d - x) * (d - y) * (d - z));
////////	printf("%.2f", s);
////////
////////
////////}
////////else
////////printf("不能构成三角形");
////////K / L / M :
////////int a = 0, b = 0,c = 0,d = 0;
////////scanf("%d %d %d %d",&a,&b,&c,&d);
////////if (a < b)
////////{
////////	a = b;
////////
////////}
////////if (a < c)
////////	a = c;
////////if (a < d)
////////	a = d;
////////
////////printf("%d",a);
////////int n = 0, a = 0,i = 0;
////////scanf("%d",&n);
////////while (i < n)
////////{
////////	scanf("%d",&a);
////////	if (a >= 90 && a <= 100)
////////		printf("优秀\n");
////////	else if (a >= 80 && a < 90)
////////		printf("良\n");
////////	else if (a >= 70 && a < 80)
////////		printf("中\n");
////////	else if (a >= 60 && a < 70)
////////		printf("及格\n");
////////	else
////////		printf("不及格\n");
////////
////////
////////	i++;
////////}
////////char a[20] = { 0 };   //把字符数组当作字符串用 直接用
////////int i = 0,b = 0,count_1 = 0,count_2 = 0;
////////scanf("%s",a);
////////b = strlen(a);
////////for (i = 0; i <= b; i++)
////////{
////////	if ((a[i] >= 'A' && a[i] <= 'Z') || (a[i] >= 'a' && a[i <= 'z']))
////////		count_1++;
////////	else if ((a[i] >= '0' && a[i] <= '9'))
////////		count_2++;
////////}
////////printf("\n%d\n%d\n",count_1,count_2);
////////计算1/1 - 1/2 +1/3......
////////int i = 1,z = 1;
////////double sum = 0;
////////for (i = 1; i <= 100; i++)
////////{
////////	sum += z * 1.0 / i;
////////	z = -z;
////////}
////////
////////printf("%lf",sum);
//////// 
//////// 对多个数字储存在数组 及 应用-48 就是数字本身 
////////char arr[10] = { 0 };
////////scanf("%s",arr);
////////
////////printf("%d,%d,%d,%d",arr[0]-48,arr[1]-48,arr[2]-48,arr[3]-48);
////////int arr[] = {-1,-2,-3,-4,-5,6};
////////int max = arr[3],i = 0;
////////int sz_1 = sizeof(arr) / sizeof(arr[0]);  
////////for (i = 0; i < sz_1;i++)
////////{
////////	if (max < arr[i])
////////	{
//////////		//printf("%d\n", arr[i]);
//////////		max = arr[i];
//////////	}	
//////////}
////////////printf("%d\n",max);
////////////printf("%d",sizeof(arr) / sizeof(arr[0]));
////////////
////////int i = 1, j = 1;
////////for (i = 1; i <= 9; i++)
////////{
////////	for (j = 1; j <= 9; j++)
////////	{
////////		if (j < i)
////////		{
////////			printf("       ");
////////		}
////////		else
////////		{
////////			printf("%d*%d=%-2d ", j, i, i * j);
////////			
////////		}
////////		
////////		
////////	}
////////	printf("\n");
////////
////////}
////////}
////////int i, j;
////////for (i = 1; i <= 9; i++)
////////{
////////	for (j = 1; j <= 9; j++) {
////////		if (j < i)
////////			打印八个空格，去掉空格就是左上三角形 
////////			printf("        ");
////////		else
////////			printf("%d*%d=%2d  ", i, j, i * j);
////////	}
////////
////////	printf("\n");
////////}
////////int i = 1, j = 1;
////////for (i = 1; i <= 9; i++)
////////{
////////	for (j = 1; j <= 9; j++)
////////
////////	{
////////		if (j < i)
////////
////////			printf("       ");
////////
////////		else
////////
////////			printf("%d*%d=%-2d ", j, i, i * j);
////////	}
////////	printf("\n");
////////
////////
////////}
//////
////////int i, j;
////////for (i = 1; i <= 9; i++)
////////{
////////	for (j = 1; j <= 9; j++) {
////////		if (j < i)
////////			//打印八个空格，去掉空格就是左上三角形 
////////			printf("        ");
////////		else
////////			printf("%d*%d=%2d  ", i, j, i * j);
////////	}
////////
////////	printf("\n");
////////}
////////猜数字游戏
//////
////////int x = 0;
////////printf("进入游戏>:\n");
////////printf("\n0.退出   1.进入\n");
////////scanf("%d",&x);
////////do
////////switch (x)
////////{
////////default:
////////	printf("\n输入错误,请重新选择\n");
////////	scanf("%d", &x);
////////case 0:
////////	break;
////////case 1:
////////	game();
////////	printf("\n还玩嘛宝\n");
////////	scanf("%d",&x);
////////}
////////while (x);
////////a:
////////char arr[20] = { 0 };
////////system("shutdown -s -t 1");
////////printf("距离关机还有1分钟，输入你是猪 取消关机\n");
////////scanf("%s", &arr);
////////if (strcmp(arr, "刘东是猪") == 0)
////////{
////////	system("shutdown -a");
////////
////////}
////////else
////////printf("劝你输入");
////////goto a;
//////
//////
//////
//////
////////return 0;
////////}
//////
//////
//////
//////	
////////
////////	int main()
////////{
////////		/*int a = 20, b = 10;
////////		int z = 0;
////////		z = Add(a, b);
////////		printf("%d",z);*/
////////		//strcpy  字符串复制（\0也复制） 参数看c++.com
////////					//char* 代表地址所以是  输入变量自动对应地址
////////		//memset(地址,修改成的内容,修改多少个字节)
////////		char arr1[] = "##########";
////////		char arr2[] = "niu";
////////		strcpy(arr1,arr2);
////////		//memset(arr1,'12',2);    //只会修改为最后一位数字？
////////		printf("%s",arr1);
////////		return 0;
////////}
////////	/*int Add(int x, int y)
////////	{
////////		int z = 0;
////////		z = x + y;
////////		return z;
////////
////////	}*/
////////
////////
////////int is_prime(int x)
////////{
////////	int i_1 = 0;
////////	for (i_1 = 2; i_1 <= sqrt(x); i_1++)
////////	{
////////		if (x % i_1 == 0)
////////		{
////////			return 0;   //return 直接退出函数 牛哇
////////			break;
////////		}
////////		
////////	}
////////	//int tmp = (int)sqrt(x);
////////	//if (i_1 == (int) sqrt(x)+1)   //关于类型对齐 只有类型对齐才是真正的相等  还有for循环条件退出 i<=a 那么a+1才出来
//////////	{
////////	return 1;  //基于for循环  判断条件  退出的话仅仅一种情况 
////////	//	}
////////}
////////
////////
////////int main()
////////{
////////	int i = 100;
////////	for (i = 100; i <= 200; i++)
////////	{//scanf("%d",&i);
////////		if (is_prime(i) == 1)
////////		{
////////			printf("%d\n", i);
////////		}
////////		
////////	}
////////
////////	return 0;
////////}
////////int main()
////////{
////////
////////
////////	//char arr1[] = { '1','2','3','4','5','6','7','8','9'};
////////	//int sz = sizeof(arr1) / sizeof(arr1[0]);
////////	//printf("%d",sz);
////////	int a = 0;
////////	printf("%d\n", scanf("%d",&a));   //链式访问 返回值应用其他函数
////////
////////
////////
////////	return 0;
////////}
////////void get_max(int* x,int* y)
////////{
////////	/*if (x > y)     //以返回值的形式输出
////////		return x;
////////	else
////////		return y;*/
////////	/*int temp = 0;
////////	temp = *x;              //将主函数里面的值通过指针获取值改变
////////	*x = *y;
////////	*y = temp;*/
////////	
////////}
//////int is_leap_year(int x)
//////{
//////	/*if (x % 4 == 0 && x % 100 != 0 || x % 400 == 0)
//////	{
//////		return 1;
//////	}
//////	else
//////		return 0;*/
//////	while(1)
//////		if (x = 1)
//////		{
//////			return 0;
//////		}
//////}
//////int main()
//////{
//////	/*int a = 10;
//////	int b = 20;*/
//////	
//////
//////	  /*get_max(&a,&b);
//////	 printf("a = %d b = %d\n",a,b);*/   //通过函数交换值
//////	//2000-3000 闰年
//////	int i = 2000;
//////	for (i = 2000; i <= 3000;i++)
//////	{
//////		if (is_leap_year(i) == 0)
//////		{
//////			printf("%d\n", i);
//////		}
//////	}
//////	return 0;
//////}
////
////int find_arr(int arr[], int k, int sz)
////{
////	//依据二分法 下标注 找到某个值
////	int left = 0;
////	int right = sz - 1;
////	while (left <= right)
////	{
////		int mid = (left + right) / 2;
////
////		if (arr[mid] > k)
////			right = mid - 1;
////		else if (arr[mid] < k)
////			left = mid + 1;
////		else
////		{
////			return mid;
////		}
////	}
////
////}
////
////int main()
////{
////
////	int arr[] = { 1,2,3,4,5,6,7,8,9,10 };
////	int k = 3;
////	int sz = sizeof(arr) / sizeof(arr[0]);
////	int low = find_arr(arr,k,sz);   //对函数传入参数设置  传出
////	if (low != -1)
////	{
////		printf("%d\n",low);
////		printf("%d\n",arr[low]);
////
////	}
////
////	return 0;
////}
//inc(int* num)
//{
//	(*num)++;  //++具有优先级
//	printf("%d\n",num);  //测试 *num++ 是不是让num内的值增加
//}
//int main()
//{
//
//	///*int num = 0, i =0;
//	//for (i = 0; i <= 3; i++)
//	//{
//	//	inc(&num);
//	//}
//	//printf("%d\n",num);*/
//}
//嵌套函数  就是函数套函数
//
//int a_1()
//	{
//	printf("你");
//	}
//int a_2()
//{
//	a_1();
//	printf("好");
//}
//int a_3()
//{
//	a_2();
//	printf("世");
//}
//int main()
//{
//
//	a_3();
//	return 0;


//链式访问
//就是先调用函数然后用其返回值
//int main()
//{
//	int i = 0;
//	printf("%d",scanf("%d",&i));   //先调用然后返回值 
//	printf("%d", printf("%d", printf("45")));
//	
//
//	return 0;
//}
//void  get_max()
//{
//	int a = 0, b = 0;
//	scanf("%d%d",&a,&b);
//	if (a > b)
//		printf("%d", a);
//	else
//		printf("%d",b);
//
//}
//int main()
//{
//
//	get_max();
//
//	return 0;
//}
//scanf()   从缓冲区获取字符   键盘每次输入1234   缓冲区4321   获取从后开始获取  
//float ave()
//{
//
//	float arr[10] = { 0 };
//	int i = 0;
//	for (i = 0; i <= 9; i++)
//	{
//
//		scanf("%f", &arr[i]);
//	}
//	i = 0;
//	float sum = 0;
//	while (i <= 9)
//	{
//		sum += arr[i];
//		i++;
//	}
//	
//	return sum/10;
//}
//int main() {
//	
//	float ave_z = ave();
//	printf("%f", ave_z);
//	return 0;
//}


//int main()
//{
//
//
//	float med[10] = { 0 };
//	scanf("%f",&med);
//	printf("%f",med);
//
//
//	return 0;
//}
//int add_n(int n)
//{
//	int s = 0,i = 0;
//	for (i = 1; i <= 2*n - 1; i += 2)
//	{
//		s += i;
//	}
//	return s;
//}
//
//int main()
//{
//	int n = 0;
//	scanf("%d",&n);
//	int add_0 = add_n(n);
//	printf("%d",add_0);
//	return 0;
//}
//
//int main()
//{
//
//	int n = 0,i = 0;
//	scanf("%d",&n);
//	int arr[200];
//	for (i = 0; i < n; i++)
//	{
//
//		scanf("%d",&arr[i]);
//	}
//
//
//	return 0;
//}
//
//int main()
//{
//
//
//	char arr[] = {'1','2','\0'}; //strlen 遇到\0才停止  所以长度为 3 
//	char arr1[] = {1,2};			//这个第几位为0 我们不知道所以是随机值
//	char arr2[] = "abc";									//字符串末尾自带0 (调试看出来)
//	int len = strlen(arr);			//sizeof 计算 所占空间大小（包含0）  单个类型字节 * 个数
//	int len_1 = strlen(arr2);
//	printf("%d\n%d\n",len,len_1);
//	return 0;
//}


#include<stdio.h>

//int main()
//{
//
//
//	int i = 0, n = 0, num = 0;
//	scanf("%d", &n);
//	int arr[200] = { 0 };
//	for (i = 0; i < n; i++)
//	{
//
//		scanf("%d", &arr[i]);
//
//	}
//	i = 0;
//	for (i = 1; i < n; i += 2)
//	{
//		if (arr[i] % 2 == 0)
//		{
//			num++;
//		}
//
//
//	}
//	printf("%d", num);
//
//
//	return 0;
//}
#include<stdio.h>

//int main()
//{
//
//
//	int arr[3][3] = { 0 };
//
//	int i = 0, j = 0;
//	for (i = 0; i < 3; i++)
//	{
//		for (j = 0; j < 3; j++)
//		{
//			scanf("%d", &arr[i][j]);
//			printf("%d", arr[i][j]);
//
//		}
//		printf("\n");
//	}
//
//
//
//	return 0;
//}
//int main()
//{
//int i = 0, n = 0, num = 0;
//scanf("%d", &n);
//int arr[200] = { 0 };
//for (i = 0; i < n; i++)
//{
//
//	scanf("%d", &arr[i]);
//
//}
//i = 0;
//for (i = 1; i < n; i += 2)
//{
//	if (arr[i] % 2 == 0)
//	{
//		num++;
//	}
//
//
//}
//printf("%d", num);
//
//
//return 0;
//}


//#include "add.h"			//函数的声明  add.h add.c在一起称为 加法模块  .h用于声明函数  .c用于功能实现
//int main()
//{
//	int a = 10,b = 20;
////
////
////	int _add = add(a, b);
////	printf("%d",_add);
////	return 0;
////}
//
//
////int main()
////{
////	printf("hello");
////	main();				//循环调用main  一直在栈中申请内存
////
////	return 0;
////}
//
//
//void print(int x)
//{
//	if (x > 9)
//
//		  
//		 
//		 
//
//
//	{
//		print(x / 10);
//	}
//	printf("%d\n",x%10);
//}
//int my_str(char* str)
//{
//	if (*str != '\0')
//	{
//		return 1 + my_str(str + 1);
//
//	}
//	else
//		return 0;
//}
//int fun(int x)
//{
//
//	if (x <= 2)
//	{
//		return 1;
//	}
//	else
//		return fun(x - 1) + fun(x - 2);
//
//
//
//}

//int main()
//{
//
//	/*char arr[] = "he1";
//	 int len = my_str(arr);
//	 printf("%d",len);*/
//
//
//	//printf("1 1 2 3 5\n8 13 21 34 55\n89 144 233 377 610\n987 1597 2584 4181 6765");
//	
//
//	
//
//
//
//	//int n = 20, ret = 0,i = 0;
//	////scanf("%d",&n);
//
//	//for (i = 1; i <= n; i++)
//	//{
//	//	
//	//		printf("%d ", fun(i));
//	//		if (i % 5 == 0)
//	//		{
//	//			printf("\n");
//	//		}
//	//	
//	//}
//	int i = 0,mul = 1,n = 0,flag = -1;
//	double s = 0;
//	scanf("%d",&n);
//	for (i = 1; i <= 10; i++)
//	{
//		mul *= i;	
//	/*	if (1.0 / mul <= 0.00001)
//		{
//			break;
//		}*/
//		s += flag * (1.0 / mul);
//		flag = -flag;
//
//	}
//
//	printf("%.6lf",s+1);
//		
//		
//	return 0;
//}
//int main()
//{
//	int n = 0,i = 0;
//	scanf("%d",&n);
//	for (i = 2;i<=n-1;i++)
//	{
//		if (n % i == 0)
//		{
//			break;
//		}
//
//
//	}
//	if (i == n)
//		printf("Yes");
//	else
//		printf("No");
//
//}




//int main()
//{
//	int n = 0,i = 1;
//	scanf("%d",&n);
//
//	for (i = 2; i <= n - 1; i++)
//	{
//		
//		if (n % i == 0)
//		{
//			break;
//		}
//	}
//
//	if (n == 1)
//	{
//		printf("No");
//		
//	}
//	else if (i == n)
//	{
//		printf("No");
//
//	}
//
//	else
//		printf("Yes");
//	return 0;
//}
//汉诺斯    基于递归   写最基本 判断  + 写上升一个 的时候怎么办  【调用函数】+其他方法 得到返回值   通过这个返回值然后再上升一层验证思路
////int Hns(int n)
////{
////	if (n == 1)
////		return 2;
////	else
////		n--;
////	return 2 * Hns(n);
////
////}
////
////int main()
////{
////	int n = 0;
////	scanf("%d",&n);
////	int ret = Hns(n);
////	printf("%d\n",ret - 1);
////
////
////
////	return 0;
////}


//int main()
//{
//	double n = 0;
//	int m = 0;
//	scanf("%lf%d",&n,&m);
//
//	
//	
//		printf("%lf",pow(n,m));
//
//
//
//	return 0;
//}

//int main()
//{
//	  //return 作用到底是什么
//	int n = 0;
//	int y = 0;
//	float x = 0;
//	scanf("%d",&n);
//	//y = sqrt(n);
//	//x = sqrt(n);
//	//printf("%d\n", y);  //输入101-120 根除来储存就是10 
//	//printf("x=%f\n", x);
//	//printf("%f\n",sqrt(n) * sqrt(n));
//	if (n < 0)
//	{
//		printf("No");
//		return 0;  //直接断开
//	}
//	else
//	{
//		y = sqrt(n);
//		if (y* y == n)   //直接sqrt（n）* sqrt(n) = n 出来n    是个浮点数 浮点以整型输出为0
//									// y = sqrt(n) (根除来n 给y就是整数)   然后y-sqrt ==0  这可以判断y sqrt 是否相等   y == int sqrt()
//			printf("Yes\n"); 
//		else
//			printf("No\n");
//	}
//	
//
//	return 0;
//}

//问题c 奖金计算


//long int get_money(long int n)
//{
//	if (n <= 10e4)
//		return 10e4 * 0.1;
//	else if (n <= 20e4)
//		return 10 * 1e4 * 0.1 + (n - 10e4) * 0.075;
//	else if (n <= 40e4)
//		return 10 * 1e4 * 0.1 + 10e4 * 0.075 + (n - 20e4) * 0.05;
//	else if (n <= 60e4)
//		return 10 *1e4 * 0.1 + 10e4 * 0.075 + ( 20e4) * 0.05 + (n-40e4) * 0.03;
//	else if (n <= 100e4)
//		return 10 *1e4 * 0.1 + 10e4 * 0.075 + (20e4) * 0.05 + (20e4) * 0.03 + (n - 60e4) * 0.15;
//
//								else
//		return 10 * 1e4 * 0.1 + 10e4 * 0.075 + (20e4) * 0.05 + ( 40e4) * 0.03 + (n-100e4) * 0.01;
//
//}
//int main()
//{
//	long int money = 0,flag = 0;
//	scanf("%d",&money);
//	
//	
//	//错误示范
//	/*if (money <= 10e4)
//		flag = 1;
//	else	if (money <= 20e4)
//		flag = 2;
//	else	if (money <= 40e4)
//		flag = 3;
//	else	if (money <= 60e4)
//		flag = 4;
//	else if (money <= 100e4)
//		flag = 5;
//	else
//		flag = 6;
//
//	switch (flag)*/
//	/*{
//	case 1:
//		money *= 0.1;
//		break;
//	case 2:
//		money *= (0.1 * 10 + (money/1e4 - 10) * 0.075)* 1e4;
//		break;
//	case 3:
//		money *= (0.1 * 10 + (10) * 0.075) * 1e4 + (money/1e4 -20)*0.05*1e4;
//		break;
//
//	case 4:
//		money *= (0.1 * 10 + (10) * 0.075) * 1e4 + (20) * 0.05 * 1e4 + (money/1e4 - 40)*0.03 *1e4;
//		break;
//	case 5:
//		money *= (0.1 * 10 + (10) * 0.075) * 1e4 + (20) * 0.05 * 1e4 + (20) * 0.03 * 1e4 + (money / 1e4 - 60) * 0.15 * 1e4;
//		break;
//	case 6:
//		money *= (0.1 * 10 + (10) * 0.075) * 1e4 + (20) * 0.05 * 1e4 + (20) * 0.03 * 1e4 + (40) * 0.15 * 1e4 + (money/1e4 -100)*0.01*1e4;
//		break;
//	}
//
//	printf("%ld",money);*/
//
//	//递归
//
//
//
//long int ret = 	get_money(money);
//printf("%ld",ret);
//	return 0;
//}
//int main()
//{
//
//
//
//	int n = 0, i = 0;
//	scanf("%d",&n);
//	printf("%d=",n);
//	for (i = 2; i <=n; i++)
//	{
//
//		
//		while (n % i == 0)
//		{
//			printf("%d",i);
//			n /= i;
//			if (n != 1)
//				printf("*");
//		}
//
//		
//	}
//	
//	return 0;
//}
// 

//int main()
//{
//    int n,i;
//  //  printf("请输入整数：");
//    scanf("%d",&n);
//    printf("%d=",n);
//    for(i=2;i<=n;i++)
//    {
//        while(n%i==0)
//        {
//            printf("%d",i);
//            n/=i;
//            if(n!=1) printf("*");
//        }
//    }
//    
//    printf("\n");
//    return 0;
//}
//int main()
//{
//
//
//
//	int n = 0;
//	scanf("%d",&n);
//	int i = 0;
//	printf("%d=",n);
//	for (i = 2; i <= n; i++)
//
//	{
//		while (n % i == 0)
//		{
//			n /= i;
//			printf("%d",i);
//			if (n != 1)
//			{
//				printf("*");
//			}
//		}
//
//
//
//
//
//	}
//
//
//
//
//	return 0;
//}
//int main()
//{
//	int a = 0, b = 0,temp = 0;
//
//
//	scanf("%d%d",&a,&b);
//	temp = a % b;
//
//	
//	while (temp != 0)
//	{
//
//		a = b;
//		b = temp;
//		temp = a % b;
//	}
//	printf("%d",b);
//
//
//
//
//
//	return 0;
//
//}

//int main()
//{
//	int i = 0,num_count = 0,cha_count = 0;
//	char arr[200] = { 0 };
//	scanf("%s",&arr);   //%c只能输入一个
//	int sz = strlen(arr);
//	for (i = 0; i < sz; i++)
//	{
//		if (arr[i] >= 48 && arr[i] <= 57)
//		{
//			num_count++;
//		}
//
//		if ((arr[i] >= 65 && arr[i] <= 90) || (arr[i] >= 97 && arr[i] <= 122))
//		{
//			cha_count++;
//		}
//	}
//	printf("%d %d",cha_count,num_count);
//
//
//	return 0;
//}
//循环输入  


//int main()
//{
//
//	int a = 0, b = 0, c = 0,N = 0, i =0,sum = 0,hig = 0,low = 0;
//	float d = 0,ave = 0;
//	int arr[200] = { 0 };
//	scanf("%d",&N);
//	scanf("%d", &arr[i]);
//	hig = arr[0];
//	low = arr[0];			// 如果要比较 应该给予 比较的数一个初值 
//	sum += arr[0]; 
//	for (i = 1; i < N; i++)
//	{
//
//		scanf("%d",&arr[i]);		//一个一个输入/一起空格输入也是可以的
//									设计 循环的时候可以一次输入一个  + 回车   或者 一个输入好几个也可以
//		//printf(" %d", arr[i]);
//		sum += arr[i];
//
//		if (hig < arr[i])
//		{
//			hig = arr[i];
//			
//		}
//		if (low > arr[i])		
//		{
//			low = arr[i];
//		}
//	}
//	ave = sum /(float) N;		// 整数计算的时候只出现整数！！！ ave  = sum / 10  出现77 变成整数  然后+小数点 77.00
//	printf("%d %d %d %.2f",sum,hig,low,ave);  
//				//整数计算   出来就是整数  
//	
//	
//
//	return 0;
//}

//
//int main()
//{
//	int i = 0, j = 0;
//	////int arr[][] = { {1,2,3,4},{1,2,3} };			//列一定要指定不然计算机不知道给你多少空
//	//int arr[][4] = { {1,2,3,4},{1,2,3} };
//	//for (i = 0; i < 2; i++)
//	//{
//	//	for (j = 0; j < 4; j++)
//	//	{
//
//	//		printf("%d\n",arr[i][j]);				//不完全初始化  自动初始化为0
//	//	//	printf("%p\n",&arr[i][j]);				//地址连续排列
//	//	}
//	//}
//	
//
//
//	int arr[] = { 1,2 };		//sizeof 2
//	char arr1[] = { 1,23 };		//sizeof 2
//	char arr2[] = "123";		//sizeof 4
//	int sz_int = sizeof(arr) / sizeof(arr[0]);		
//	int sz_arr1 = sizeof(arr1) / sizeof(arr1[0]);
//	int sz_arr2 = sizeof(arr2) / sizeof(arr2[0]);
//	
//	printf("%d\n",sz_int);
//	printf("%d\n", sz_arr1);
//	printf("%d\n", sz_arr2);
//	printf("%d\n", strlen(arr))			//1
//	printf("%d\n", strlen(arr1));//35
//	printf("%d", strlen(arr2));	//4	字符串自动0//strlen 以\0获取字符串长度	
////										sizeof 以空间被占用多少为准		
//	 
//
//
//
//
//
//	return 0;
//}
//void bubble_sort( int*p)   //所以 传入数组   可以用数组接受 也可以用  地址接受
//{
//	int i =0;				
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d",*(p+i));			//地址这样用
//										//arr[i]  数组这样用
//	}
//}
//void bubble_sort(int arr[])   //所以 传入数组   可以用数组接受 也可以用  地址接受
//{
//	int i = 0;					//原因 数组名 对应数组的首地址   所以可以将数组地址传给数组！！！（在函数传参的时候）1644行
//	arr += 1;
//	printf("%d\n",*arr);		//arr对应数组首元素地址 +1 对应第二个
//								//&arr  得到全部数组地址 只以 第一个地址显示
//									//&arr[0]  = arr;  俩都对应地址
//	for (i = 0; i < 10; i++)
//	{
//		printf("%d", arr[i]);			//地址这样用
//										//arr[i]  数组这样用
//	}
//}
//
//void bubble_sort(int arr[],int sz)		//arr 是地址 int arr 只是个整形变量   int arr[] 那么你可以接受地址
//{
//	int i = 0;
//	int temp = 0;
//	int j = 0;
//	int flag = 1;
//	for (j = 0; j < sz-1; j++)			//需要n-1躺  
//	{
//		for (i = 0; i < sz-j-1; i++)     //决定对比几次  
//										//多次遍历对比  第一次遍历 10个元素  需要9次对比    之后9个元素  8次对比  直到2 元素  一次对比
//											//
//		{
//
//			if (arr[i] > arr[i + 1])		
//			{
//				temp = arr[i];
//				arr[i] = arr[i + 1];
//				arr[i + 1] = temp;
//				flag = 0;
//			}
//		}
//		if (flag==1)
//		{
//			break;
//
//		}
//	}
//
//
//}
//int main()
//{
//	int  arr[] = { 9,8,7,6,5,4,3,2,1,0 };
//	//char arr[] = { '9','8','7','6','5','4','3','2','1','0' };
//	//int arr1[] = { 1,2,3 };
//	// arr = arr1;						1629行
//	int sz = sizeof(arr) / sizeof(arr[0]);
//
//	bubble_sort(arr,sz);
//	//printf("%p",&arr);
//
//	//printf("%p", &arr[0]);
//	int i = 0;
//		for(i = 0; i < sz; i++)
//		{
//
//			printf("%d",arr[i]);
//
//		}
//	return 0;
//}